UnboundedHeight Property
 Get the Unbounded Height of the Room.
  Namespace:   Autodesk.Revit.DB.Architecture
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public double UnboundedHeight { get; }
  Visual Basic
Public ReadOnly Property UnboundedHeight As Double
	Get
  Visual C++
public:
property double UnboundedHeight {
	double get ();
}
 Remarks
 This property is used to get the Unbounded Height of the Room.
 See Also
  Room Class
  Autodesk.Revit.DB.Architecture Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →